In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(data={
    'City':['New York','Paris','London'],
    'Country':['America','France','England'],
    'Population':[800000,300000,700000]
})

df

       City  Country  Population
0  New York  America      800000
1     Paris   France      300000
2    London  England      700000

In [3]:
df.transpose()

                   0       1        2
City        New York   Paris   London
Country      America  France  England
Population    800000  300000   700000

In [4]:
r = np.random.randint(1, 100, [3,5])

df = pd.DataFrame(data=r, index=['one','two','three'], columns=['a','b','c','d','e'])

df

        a   b   c   d   e
one    38  53  86  40  64
two    79  34  29  74  19
three  63  75  13  97  37

In [5]:
nba = pd.read_csv('nba.csv', parse_dates = ['Birthday'])

nba.dtypes

C:\Users\Thinkpad\AppData\Local\Temp\ipykernel_11500\1930364034.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv('nba.csv', parse_dates = ['Birthday'])

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [6]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [7]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [8]:
nba.shape

(450, 5)

In [9]:
nba.size

2250

In [11]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [12]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [13]:
nba.nlargest(2, 'Salary')

              Name                   Team Position   Birthday    Salary
205  Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38      Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482

In [15]:
nba.sort_values(by=['Position','Birthday'])

                  Name                    Team Position   Birthday    Salary
196      Udonis Haslem              Miami Heat        C 1980-06-09   2564753
149     Tyson Chandler         Houston Rockets        C 1982-10-02   2564753
58          Marc Gasol         Toronto Raptors        C 1985-01-29  25595700
409         Taj Gibson         New York Knicks        C 1985-06-24   9000000
40   LaMarcus Aldridge       San Antonio Spurs        C 1985-07-19  26000000
..                 ...                     ...      ...        ...       ...
346      Jaylen Nowell  Minnesota Timberwolves       SG 1999-07-09   1400000
405     Romeo Langford          Boston Celtics       SG 1999-10-25   3458400
147        Tyler Herro              Miami Heat       SG 2000-01-20   3640200
173         Coby White           Chicago Bulls       SG 2000-02-16   5307120
313         RJ Barrett         New York Knicks       SG 2000-06-14   7839960

[450 rows x 5 columns]

In [16]:
nba.set_index(keys='Name')

                               Team Position   Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [17]:
nba['Salary']

0       1445697
1       1645357
2       3831840
3       7317074
4         79568
         ...
445     2174310
446     2578800
447     4767000
448     4764960
449    16200000
Name: Salary, Length: 450, dtype: int64

In [30]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.loc['LeBron James']

Team        Los Angeles Lakers
Position                    PF
Birthday              12/30/84
Salary                37436858
Name: LeBron James, dtype: object

In [32]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.sort_index().loc['Aaron Holiday':'Admiral Schofield']

                                    Team Position Birthday   Salary
Name
Aaron Holiday             Indiana Pacers       PG  9/30/96  2239200
Abdel Nader        Oklahoma City Thunder       SF  9/25/93  1618520
Adam Mokoka                Chicago Bulls        G  7/18/98    79568
Admiral Schofield     Washington Wizards       SF  3/30/97  1000000

In [34]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.iloc[2:5]

                             Team Position Birthday   Salary
Name
PJ Washington   Charlotte Hornets       PF  8/23/98  3831840
Derrick Rose      Detroit Pistons       PG  10/4/88  7317074
Marial Shayok  Philadelphia 76ers        G  7/26/95    79568

In [37]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.loc['Christian Wood','Salary']

1645357

In [41]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.at['LeBron James','Salary']

37436858

In [42]:
nba = pd.read_csv('nba.csv', index_col='Name')
nba.iat[15,3]

4767000

In [45]:
nba.rename(columns={'Salary':'Pay'})

                               Team Position  Birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG   9/26/96   1445697
Christian Wood      Detroit Pistons       PF   9/27/95   1645357
PJ Washington     Charlotte Hornets       PF   8/23/98   3831840
Derrick Rose        Detroit Pistons       PG   10/4/88   7317074
Marial Shayok    Philadelphia 76ers        G   7/26/95     79568
...                             ...      ...       ...       ...
Austin Rivers       Houston Rockets       PG    8/1/92   2174310
Harry Giles        Sacramento Kings       PF   4/22/98   2578800
Robin Lopez         Milwaukee Bucks        C    4/1/88   4767000
Collin Sexton   Cleveland Cavaliers       PG    1/4/99   4764960
Ricky Rubio            Phoenix Suns       PG  10/21/90  16200000

[450 rows x 4 columns]

In [47]:
nba.reset_index().set_index('Team')

                               Name Position  Birthday    Salary
Team
Philadelphia 76ers     Shake Milton       SG   9/26/96   1445697
Detroit Pistons      Christian Wood       PF   9/27/95   1645357
Charlotte Hornets     PJ Washington       PF   8/23/98   3831840
Detroit Pistons        Derrick Rose       PG   10/4/88   7317074
Philadelphia 76ers    Marial Shayok        G   7/26/95     79568
...                             ...      ...       ...       ...
Houston Rockets       Austin Rivers       PG    8/1/92   2174310
Sacramento Kings        Harry Giles       PF   4/22/98   2578800
Milwaukee Bucks         Robin Lopez        C    4/1/88   4767000
Cleveland Cavaliers   Collin Sexton       PG    1/4/99   4764960
Phoenix Suns            Ricky Rubio       PG  10/21/90  16200000

[450 rows x 4 columns]